app/Controllers/admin/Home.php

    public function index()
    {
        if (!$this->ionAuth->loggedIn()  || !$this->ionAuth->isAdmin()) {
            return redirect()->to('login');
        } else {
            $db = \Config\Database::connect();
            $company_title = (isset($settings['title'])) ? $settings['title'] : "Maareeye";
            $data['page'] = "index";
            $data['title'] = "Welcome to - ". $company_title;
            $data['meta_keywords'] = "subscriptions app, digital subscription, daily subscription, software, app, module";
            $data['meta_description'] = "Home - Welcome to Subscribers, an digital solution for your subscription based daily problems";
            $version = fetch_details('updates', [], ['version'], '1', '0', 'id', 'DESC')[0]['version'];
            $data['version'] = $version;
            $session = session();
            $lang = $session->get('lang');
            if (empty($lang)) {
                $lang = 'en';
            }
            $data['code'] = $lang;
            $data['current_lang'] = $lang;
            $data['languages_locale'] = fetch_details('languages', [], [], null, '0', 'id', 'ASC');

            $settings = get_settings('general', true);
            $data['currency'] = (isset($settings['currency_symbol'])) ? $settings['currency_symbol'] : '₹';

            $id = $_SESSION['user_id'];
            $group =  get_group('vendors');
            $group_id = $group[0]['group_id'];
            $packages = $db->table('packages')->select('count(id) as total')->get()->getResultArray()[0]['total'];
            $sold_packages = $db->table('users_packages')->select('count(id) as total')->get()->getResultArray()[0]['total'];
            $earning = floatval($db->table('transactions')->select('sum(amount) as total')->get()->getResultArray()[0]['total']);
            $vendor_count = $db->table('users_groups')->select('count(group_id) as total')->where('group_id', $group_id)->get()->getResultArray()[0]['total'];
---
SELECT count(id) as total
FROM `packages`
SELECT count(id) as total
FROM `users_packages`
SELECT sum(amount) as total
FROM `transactions`
SELECT count(group_id) as total
FROM `users_groups`
WHERE `group_id` = '2'