app/Helpers/function_helper.php

SELECT `ug`.*, `g`.`name`
FROM `groups` as `g`
LEFT JOIN `users_groups` as `ug` ON `g`.`id` = `ug`.`group_id`
WHERE `g`.`name` = 'vendors'
---
function get_group($name = "")
{
    $db = \Config\Database::connect();
    $builder = $db->table("groups as g");
    $builder->select('ug.*,g.name');
    $builder->where('g.name', $name);
    $builder->join('users_groups as ug', 'g.id = ug.group_id ', "left");
    $group = $builder->get()->getResultArray();