app/Models/Vendors_model.php

    public function get_vendors()
    {
        $group = get_group('vendors');
        $group_id = $group[0]['group_id'] ?? null;

        if (!$group_id) {
            return ['total' => 0, 'data' => []];
        }

        $db = \Config\Database::connect();
        $builder = $db->table("users as u");
        $builder->select('u.*, ug.group_id');
        $builder->join('users_groups as ug', 'u.id = ug.user_id', 'left');
        $builder->where('ug.group_id', $group_id);

        // Handle search
        $search = $_GET['search'] ?? '';
        if (!empty($search)) {
            $builder->groupStart()
                ->orLike('u.id', $search)
                ->orLike('u.first_name', $search)
                ->orLike('u.last_name', $search)
                ->orLike('u.email', $search)
                ->orLike('u.mobile', $search)
                ->orLike('u.active', $search)
                ->groupEnd();
        }

        // Clone for total count
        $countBuilder = clone $builder;
        $total = $countBuilder->select('COUNT(DISTINCT u.id) as total')->get()->getRow()->total ?? 0;
---
SELECT `u`.*, `ug`.`group_id`, COUNT(DISTINCT u.id) as total
FROM `users` as `u`
LEFT JOIN `users_groups` as `ug` ON `u`.`id` = `ug`.`user_id`
WHERE `ug`.`group_id` = '2'